---
kind: method
id: M:Autodesk.Revit.DB.ExportPatternInfo.#ctor(Autodesk.Revit.DB.ExportPatternInfo)
source: html/1dfb8e36-affd-76cf-cd1a-77e59ba43256.htm
---
# Autodesk.Revit.DB.ExportPatternInfo.#ctor Method

Constructs a new copy of the input ExportPatternInfo object.

## Syntax (C#)
```csharp
public ExportPatternInfo(
	ExportPatternInfo other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.ExportPatternInfo`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null